import React from 'react'
import "./twelve.css";

const Twelve = () => {
  return (

    <div className='twelve-page flex flex-col'>
      <p className='text-3xl font-semibold text-red-700 mb-5'>Love You Unlimited Mrs-Ji</p>
      <p className='text-xl font-semibold text-sky-900 mb-5' >Happy First Meet Anniversary Mrs-Ji</p>
      <p className='text-base text-black mb-3 mx-5 '>1 जून 2025
        आज का दिन कुछ खास एहसासों से भरा है।
        आज से ठीक एक साल पहले, जब तनु और रजनीश की नज़रें मिली थीं,
        तब शायद किस्मत ने तय कर लिया था कि —
        "अब ये दो दिल कभी जुदा नहीं होंगे।"

        इस एक साल में हज़ारों लम्हे बीते,
        कभी हँसी, कभी आँसू,
        कभी लड़ाई, तो कभी और भी ज़्यादा प्यार।

        पर सबसे ख़ास बात —
        हर दिन, हर पल, एक-दूसरे के साथ थे।

        आज 1 जून 2025 को,
        दोनों के रिश्ते ने एक और मुकाम छू लिया है —
        जहां भरोसा और प्यार पहले से कई गुना ज़्यादा है।


        "तू भूतू, मैं जिराफ़,
        पर साथ में सबसे शानदार ग्राफ़!
        लड़ते भी हैं, प्यार भी करते हैं,
        एक-दूसरे के बिना अधूरे ही लगते हैं।"

        "साल भर में जितनी दुआएं मांगी थीं हमने,
        हर दुआ में सिर्फ तेरा नाम था…
        आज उस एक साल को देखकर लगता है,
        प्यार सच में रब का इनाम था।"

        भूतू सी मासूमियत, जिराफ़ सी ऊँचाई,
        इनके प्यार की अपनी ही गहराई।
        ना तकरार, ना कोई दूरी,
        साथ में दोनों हैं एक प्यारी सी कहानी पूरी। 💞

      </p>

      <p className='text-xl font-semibold text-red-700 mb-5 fixed bottom-10 mx-5' >हर मुस्कान तेरे नाम, हर पल तुझसे खास,
        ये छोटा सा तोहफ़ा जिराफ़ की तरफ़ से, मेरी भूतू के पास।"</p>

    </div>

  )
}

export default Twelve