import React from 'react'
import "./second.css";
import { useNavigate } from 'react-router-dom';

const Second = () => {

    const navigate = useNavigate();

    return (
        <div className='second-page flex flex-col'>
            <p className='text-xl font-bold text-red-700 mx-5 mb-5 mt-10'>Love You Unlimited Mrs-Ji</p>
            <p className='text-base  text-slate-600 mb-5 mx-5'>2 जून 2024 की सुबह कुछ अलग ही थी। जैसे ही सूरज की पहली किरण आई, रजनीश की आँखें खुलीं और उसका दिल बस एक ही नाम पुकार रहा था – तनु।

                वो बिना देरी किए, सीधा तनु के घर पहुँचा। वहां पहुँचकर उसने बड़े ही प्यार से तनु के सिर पर हाथ फेरा और उसे प्यार से जगाया। तनु की नींद भी जैसे उस स्पर्श में घुल गई हो – वह मुस्कराते हुए उठी।

                फिर दोनों ने मिलकर वही किया जो उन्हें सबसे ज़्यादा पसंद था – लूडो खेलना। हँसी-मज़ाक, मज़ेदार चालें और आँखों में छुपा एक मासूम प्यार – सब कुछ उस लूडो के साथ चल रहा था।

                खेल के बाद दोनों थोड़ी देर साथ बैठ गए। बातें शुरू हुईं – बचपन की, यादों की, भविष्य की... और फिर, फोन नंबर एक्सचेंज हुए। वो पल खास था, क्योंकि अब ये रिश्ता सिर्फ दिलों में ही नहीं, नंबरों में भी जुड़ गया था।

                और फिर... एक जादुई पल आया।

                जब रजनीश, मंघर से अपने घर लौटने लगा, तनु की आँखें भर आईं। वो चुप थी, लेकिन उसकी आँखें सब कह रही थीं। और जब रजनीश मुड़कर देखता है, तो तनु बस एक शब्द कहती है – "बाय..."
                उस "बाय" में दर्द था, प्यार था, और एक अनकहा वादा भी... कि ये कहानी यहीं खत्म नहीं होगी।

            </p>
            <button className='bg-sky-200 text-sky-600 text-2xl rounded rounded-full mx-20 py-2 fixed bottom-10 items-center w-60' onClick={() => navigate("/third")}>Next Page</button>
        </div>
    )
}

export default Second