import React from 'react'
import "./third.css";
import { useNavigate } from 'react-router-dom';

const Third = () => {

    const navigate=useNavigate();
    
    return (
        <div className='third-page flex flex-col'>
            
            <p className='text-2xl font-bold text-red-700 mx-5 mb-5 mt-5'>Love You Unlimited Dhan-Ji</p>
            <p className='text-base font-semibold text-slate-900 mb-20 mx-5 '>मेरी जान तनु,

                आज मैं तुम्हें कुछ ऐसा बताना चाहता हूँ जो मेरे दिल में कब से छुपा हुआ है —
                तुम्हारे वो प्यारे-प्यारे नाम, जो मैं हर पल तुम्हारे लिए सोचता हूँ।
                शायद तुम मुस्कराओगी, शायद नाराज़ भी हो जाओ, पर हर नाम में सिर्फ एक ही चीज़ है — मेरा प्यार।

                तुम मेरे लिए कभी भूतू बन जाती हो — अचानक सामने आकर दिल की धड़कनें बढ़ा देती हो।
                कभी तुम बन जाती हो मेरी मिसेज जी, क्योंकि मन से तो तुम कब की मेरी हो चुकी हो।
                तुम मेरी धन जी भी हो — क्योंकि तुमसे कीमती मुझे कुछ नहीं लगता।

                जब तुम मुस्कराती हो ना, तो मुझे लगता है कि कोई लाडू सामने बैठा है — गोल-मटोल, मीठा और प्यारा।
                तुम्हारी हर नादानी मुझे हँसाती है, इसलिए तुम मेरी पगली भी हो और मेरी नॉटी पाई भी।

                तुम मेरी लाइफलाइन हो — तुम्हारे बिना ज़िंदगी अधूरी है।
                तुम्हारा "बेटू" बनकर जीना मुझे बहुत अच्छा लगता है, और तुम्हें स्वीटी पाई, लवली पाई, क्यूटी पाई कहकर बुलाना मेरे दिन का सबसे मीठा हिस्सा है।

                तुम्हारी हर बात में मसाला होता है, तुम मेरी झलमुरी हो — कभी तीखी, कभी नमकीन, लेकिन हमेशा मज़ेदार।
                कभी-कभी जब तुम तुनकती हो, तो लगती हो एकदम छोटा डॉन जैसी, और जब बिना वजह लड़ पड़ती हो तो बन जाती हो मेरी लड़ाकू विमान।
                फिर भी, मैं जानता हूँ — तुम मेरी कलेशी हो, और हर झगड़े में छुपा होता है प्यार।

                और हाँ, जब तुम मस्ती में पागल औरत बगैर बिल्ला बन जाती हो ना, तो मुझे तुमसे और भी ज़्यादा प्यार हो जाता है।
                क्योंकि तुम जैसी हो — एकदम मेरी हो।

                तुम्हारा रजनीश ❤️</p>
                 <button className='bg-sky-200 text-sky-600 text-2xl rounded rounded-full mx-20 py-2 fixed bottom-10 items-center w-60' onClick={() => navigate("/fourth")}>Next Page</button>
        
        </div>
    )
}

export default Third